"""
Напишите класс Counter, имеющий следующие методы:

- __init__(self): конструктор, создающий счетчик и устанавливающий его значение в 0;
- __call__(self): магический метод, который позволяет использовать объект класса Counter как функцию, возвращающую текущее значение счетчика;
- increment(self): метод, увеличивающий значение счетчика на 1.
"""


class Counter:
    def __init__(self, count=0):
        """Конструктор, создающий счетчик и устанавливающий его значение в 0"""
        self.count = count

    def __call__(self, *args, **kwargs):
        """Магический метод, который позволяет использовать объект класса Counter как функцию,
        возвращающую текущее значение счетчика"""
        return self.count

    def increment(self):
        """Метод, увеличивающий значение счетчика на 1"""
        self.count += 1



# код для проверки 
counter = Counter()
print(counter())  # 0

counter.increment()
print(counter())  # 1

counter.increment()
print(counter())  # 2
